nateihle/AmazonHarmonyIntegration/harmony/v2_06/framework/peripheral/glcd/processor/glcd_p32mz2064dab169.h
PLIB_INLINE_API bool PLIB_GLCD_LayerBilinearFilterIsEnabled(GLCD_MODULE_ID index, GLCD_LAYER_ID layerId)
{
     return GLCD_LayerBilinearFilterIsEnabled_Default(index, layerId);
}

PLIB_INLINE_API bool PLIB_GLCD_ExistsLayerEnable(GLCD_MODULE_ID index)
{
     return GLCD_ExistsLayerEnable_Default(index);
}

PLIB_INLINE_API void PLIB_GLCD_LayerEnable(GLCD_MODULE_ID index, GLCD_LAYER_ID layerId)
{
     GLCD_LayerEnable_Default(index, layerId);
}

PLIB_INLINE_API void PLIB_GLCD_LayerDisable(GLCD_MODULE_ID index, GLCD_LAYER_ID layerId)
{
     GLCD_LayerDisable_Default(index, layerId);
}

PLIB_INLINE_API bool PLIB_GLCD_LayerIsEnabled(GLCD_MODULE_ID index, GLCD_LAYER_ID layerId)
{
     return GLCD_LayerIsEnabled_Default(index, layerId);
}

PLIB_INLINE_API bool PLIB_GLCD_ExistsLayerStartXY(GLCD_MODULE_ID index)
{
     return GLCD_ExistsLayerStartXY_Default(index);
}

PLIB_INLINE_API void PLIB_GLCD_LayerStartXYSet(GLCD_MODULE_ID index, GLCD_LAYER_ID layerId, uint32_t startX, uint32_t startY)
{
     GLCD_LayerStartXYSet_Default(index, layerId, startX, startY);
}

PLIB_INLINE_API uint32_t PLIB_GLCD_LayerStartXGet(GLCD_MODULE_ID index, GLCD_LAYER_ID layerId)
{
     return GLCD_LayerStartXGet_Default(index, layerId);
}

PLIB_INLINE_API uint32_t PLIB_GLCD_LayerStartYGet(GLCD_MODULE_ID index, GLCD_LAYER_ID layerId)
{
     return GLCD_LayerStartYGet_Default(index, layerId);
}

PLIB_INLINE_API bool PLIB_GLCD_ExistsLayerSizeXY(GLCD_MODULE_ID index)
{
     return GLCD_ExistsLayerSizeXY_Default(index);
}

PLIB_INLINE_API void PLIB_GLCD_LayerSizeXYSet(GLCD_MODULE_ID index, GLCD_LAYER_ID layerId, uint32_t sizeX, uint32_t sizeY)
{
     GLCD_LayerSizeXYSet_Default(index, layerId, sizeX, sizeY);
}

PLIB_INLINE_API uint32_t PLIB_GLCD_LayerSizeXGet(GLCD_MODULE_ID index, GLCD_LAYER_ID layerId)
{
     return GLCD_LayerSizeXGet_Default(index, layerId);
}

PLIB_INLINE_API uint32_t PLIB_GLCD_LayerSizeYGet(GLCD_MODULE_ID index, GLCD_LAYER_ID layerId)
{
     return GLCD_LayerSizeYGet_Default(index, layerId);
}

PLIB_INLINE_API bool PLIB_GLCD_ExistsLayerBaseAddress(GLCD_MODULE_ID index)
{
     return GLCD_ExistsLayerBaseAddress_Default(index);
}

PLIB_INLINE_API void PLIB_GLCD_LayerBaseAddressSet(GLCD_MODULE_ID index, GLCD_LAYER_ID layerId, uint32_t baseAddress)
{
     GLCD_LayerBaseAddressSet_Default(index, layerId, baseAddress);
}

PLIB_INLINE_API uint32_t PLIB_GLCD_LayerBaseAddressGet(GLCD_MODULE_ID index, GLCD_LAYER_ID layerId)
{
     return GLCD_LayerBaseAddressGet_Default(index, layerId);
}

PLIB_INLINE_API bool PLIB_GLCD_ExistsLayerStride(GLCD_MODULE_ID index)
{
     return GLCD_ExistsLayerStride_Default(index);
}

PLIB_INLINE_API void PLIB_GLCD_LayerStrideSet(GLCD_MODULE_ID index, GLCD_LAYER_ID layerId, uint32_t stride)
{
     GLCD_LayerStrideSet_Default(index, layerId, stride);
}

PLIB_INLINE_API uint32_t PLIB_GLCD_LayerStrideGet(GLCD_MODULE_ID index, GLCD_LAYER_ID layerId)
{
     return GLCD_LayerStrideGet_Default(index, layerId);
}

PLIB_INLINE_API bool PLIB_GLCD_ExistsLayerResXY(GLCD_MODULE_ID index)
{
     return GLCD_ExistsLayerResXY_Default(index);
}

PLIB_INLINE_API void PLIB_GLCD_LayerResXYSet(GLCD_MODULE_ID index, GLCD_LAYER_ID layerId, uint32_t resolutionX, uint32_t resolutionY)
{
     GLCD_LayerResXYSet_Default(index, layerId, resolutionX, resolutionY);
}

PLIB_INLINE_API uint32_t PLIB_GLCD_LayerResXGet(GLCD_MODULE_ID index, GLCD_LAYER_ID layerId)
{
     return GLCD_LayerResXGet_Default(index, layerId);
}

PLIB_INLINE_API uint32_t PLIB_GLCD_LayerResYGet(GLCD_MODULE_ID index, GLCD_LAYER_ID layerId)
{
     return GLCD_LayerResYGet_Default(index, layerId);
}

PLIB_INLINE_API bool PLIB_GLCD_ExistsHSyncInterruptEnable(GLCD_MODULE_ID index)
{
     return GLCD_ExistsHSyncInterruptEnable_Default(index);
}

PLIB_INLINE_API void PLIB_GLCD_HSyncInterruptEnable(GLCD_MODULE_ID index)
{
     GLCD_HSyncInterruptEnable_Default(index);
}

PLIB_INLINE_API void PLIB_GLCD_HSyncInterruptDisable(GLCD_MODULE_ID index)
{
     GLCD_HSyncInterruptDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_GLCD_HSyncInterruptIsEnabled(GLCD_MODULE_ID index)
{
     return GLCD_HSyncInterruptIsEnabled_Default(index);
}

PLIB_INLINE_API bool PLIB_GLCD_ExistsVSyncInterruptEnable(GLCD_MODULE_ID index)
{
     return GLCD_ExistsVSyncInterruptEnable_Default(index);
}

PLIB_INLINE_API void PLIB_GLCD_VSyncInterruptEnable(GLCD_MODULE_ID index)
{
     GLCD_VSyncInterruptEnable_Default(index);
}

PLIB_INLINE_API void PLIB_GLCD_VSyncInterruptDisable(GLCD_MODULE_ID index)
{
     GLCD_VSyncInterruptDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_GLCD_VSyncInterruptIsEnabled(GLCD_MODULE_ID index)
{
     return GLCD_VSyncInterruptIsEnabled_Default(index);
}

PLIB_INLINE_API bool PLIB_GLCD_ExistsIRQTriggerControl(GLCD_MODULE_ID index)
{
     return GLCD_ExistsIRQTriggerControl_Default(index);
}

PLIB_INLINE_API void PLIB_GLCD_IRQTriggerControlSet(GLCD_MODULE_ID index, GLCD_IRQ_TRIGGER_CONTROL irqControl)
{
     GLCD_IRQTriggerControlSet_Default(index, irqControl);
}

PLIB_INLINE_API GLCD_IRQ_TRIGGER_CONTROL PLIB_GLCD_IRQTriggerControlGet(GLCD_MODULE_ID index)
{
     return GLCD_IRQTriggerControlGet_Default(index);
}

PLIB_INLINE_API bool PLIB_GLCD_ExistsIsVerticalBlankingActive(GLCD_MODULE_ID index)
{
     return GLCD_ExistsIsVerticalBlankingActive_Default(index);
}

PLIB_INLINE_API bool PLIB_GLCD_IsVerticalBlankingActive(GLCD_MODULE_ID index)
{
     return GLCD_IsVerticalBlankingActive_Default(index);
}

PLIB_INLINE_API bool PLIB_GLCD_ExistsDESignalLevel(GLCD_MODULE_ID index)
{
     return GLCD_ExistsDESignalLevel_Default(index);
}

PLIB_INLINE_API bool PLIB_GLCD_DESignalLevelGet(GLCD_MODULE_ID index)
{
     return GLCD_DESignalLevelGet_Default(index);
}

PLIB_INLINE_API bool PLIB_GLCD_ExistsHSyncSignalLevel(GLCD_MODULE_ID index)
{
     return GLCD_ExistsHSyncSignalLevel_Default(index);
}

PLIB_INLINE_API bool PLIB_GLCD_HSyncSignalLevelGet(GLCD_MODULE_ID index)
{
     return GLCD_HSyncSignalLevelGet_Default(index);
}

PLIB_INLINE_API bool PLIB_GLCD_ExistsVSyncSignalLevel(GLCD_MODULE_ID index)
{
     return GLCD_ExistsVSyncSignalLevel_Default(index);
}

PLIB_INLINE_API bool PLIB_GLCD_VSyncSignalLevelGet(GLCD_MODULE_ID index)
{
     return GLCD_VSyncSignalLevelGet_Default(index);
}

